app/Controllers/Admin.php

    public function kelolauser()
    {
        $authCheck = $this->checkAuth();
        if ($authCheck) return $authCheck;

        $data = [
            'title' => 'Kelola User',
            'users' => $this->userModel->findAll(),
---
SELECT *
FROM `users`

            'created_at' => date('Y-m-d H:i:s')
        ];

        if ($this->filmModel->insert($data)) {
---
INSERT INTO `films` (`title`, `genre`, `year`, `video_path`, `poster_path`, `description`, `rating`, `created_at`) VALUES ('Bahlil vs Jokowi', 'Comedy', '2023', 'ssstik.io_@anothelle_1740716881877.mp4', 'toy_story_4.jpg', '', '9', '2025-11-21 08:59:05')