app/Controllers/Favorite.php

    public function index()
    {
        $favModel = new FavoriteModel();
        $filmModel = new FilmModel();
        $userId = session('user_id');

        // Ambil daftar film favorit user
        $movies = $favModel
            ->where('user_id', $userId)
            ->findAll();
---
SELECT *
FROM `favorites`
WHERE `user_id` = '2'

    private function getLocalRecommendations($count = 5)
    {
        $filmModel = new FilmModel();

        try {
            // Ambil film random dari database
            return $filmModel
                ->orderBy('RAND()')
                ->limit($count)
                ->findAll();
---
SELECT *
FROM `films`
ORDER BY RAND()
 LIMIT 5