app/Models/FilmModel.php

    public function getFilmCount()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `films`

    public function getAllFilms()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `films`
ORDER BY `created_at` DESC

    public function getFilmById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `films`
WHERE `films`.`id` = '1'