app/Models/UserModel.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function getUserCount()
    {
        return $this->countAllResults();